rovCase_u0.4/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   1;
    log             no;

    patches         ("BROV2");

    rho             rhoInf;
    rhoInf          1000;       // water [kg/m^3]

    CofR            (0.2875 0.127 0.2286);  // body centre
}

// ************************************************************************* //
